# config.py

# הגדרות תצוגה וגרפיקה
CELL_SIZE = 100          # פיקסלים למשבצת

# הגדרות פיזיקה וזמן
PIECE_SPEED = 100        # פיקסלים לשנייה

# חישוב דינמי: כמה מילישניות לוקח לעבור משבצת אחת?
# (גודל משבצת חלקי מהירות) כפול 1000 כדי להפוך לשניות למילישניות
STEP_DURATION_MS = int((CELL_SIZE / PIECE_SPEED) * 1000)

COOLDOWN_BY_KIND = {
    "pawn": 1500,        # רגלי זקוק רק ל-1.5 שניות
    "queen": 5000,       # מלכה חזקה זקוקה ל-5 שניות
    "king": 2000,
    "rook": 3000,
    "bishop": 3000,
    "knight": 3000
}

DEFAULT_COOLDOWN = 3000